In [4]:
import pandas as pd
import numpy as np

test = pd.read_csv("./test.csv")
train = pd.read_csv("./train.csv")

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [72]:
# q3
test.shape

(418, 11)

In [60]:
# q4
train["Age"].min() 
train["Age"].max()

80.0

In [62]:
# q5
# slicing rows in the dataframe: you only specify the array, no need to put a[i] since [i] is implicitly there because you loop through everything
# key idea is that series with one column are just ndarrays (?)
train["Sex"].value_counts()

0.6475869809203143

In [7]:
# q6
# slice the dataframe by row AND column and turn
train.groupby(by="Pclass").mean()

        PassengerId  Survived        Age     SibSp     Parch       Fare
Pclass
1        461.597222  0.629630  38.233441  0.416667  0.356481  84.154687
2        445.956522  0.472826  29.877630  0.402174  0.380435  20.662183
3        439.154786  0.242363  25.140620  0.615071  0.393075  13.675550

In [13]:
# q7
import re
# match one or more characters followed by a .
# value_counts tracks the frequency of every entry
# train["Name"].apply(lambda x: re.findall("[A-Za-z]+\.", x) : uses the apply function to generate a new series with only the title, then get a new series showing the frequency map of titles, then convert it to a dict
train["Name"].apply(lambda x: re.findall("[A-Za-z]+\.", x)[0]).value_counts().to_dict()

{'Mr.': 517,
 'Miss.': 182,
 'Mrs.': 125,
 'Master.': 40,
 'Dr.': 7,
 'Rev.': 6,
 'Mlle.': 2,
 'Col.': 2,
 'Major.': 2,
 'Lady.': 1,
 'Ms.': 1,
 'Jonkheer.': 1,
 'Sir.': 1,
 'Don.': 1,
 'Mme.': 1,
 'Countess.': 1,
 'Capt.': 1}